**Free
///
// Moder RPG Hello world
///
Ctl-opt DftActGrp(*no) main(main);

Dcl-proc main;
  Dcl-pi *n;
  end-pi;

  dsply 'Hello world!';

  return;

End-proc;