**Free
///
// Modern RPG Cycle example
///
Ctl-opt DftActGrp(*no);

// Interface
Dcl-pi *n int;
end-pi;

dsply 'Hello world!';

return 0;

// RPG Cycle end
*inlr = *on;
