**Free
///
// RPG Module with only 1 procedure, which is also the main
///
Ctl-opt main(main);

Dcl-proc main;
  Dcl-pi *n;
  end-pi;

  dsply 'Hello world!';

  return;

End-proc;