**Free
///
// Moder RPG Hello world
///
Ctl-opt DftActGrp(*no) main(main);

Dcl-proc main;
  Dcl-pi *n int;
  end-pi;

  dsply 'Hello world!';

  return 0;

End-proc