**Free
///
// RPG Module with only 1 procedure, which is also the main.
// No prototype for hello.
///
Ctl-opt main(main);

Dcl-proc main;
  Dcl-pi *n;
  end-pi;

  hello();

  return;

End-proc;