**Free
///
// RPG Module with only 1 prototyped procedure, which is also the main
///
Ctl-opt main(main);

Dcl-pr hello;
End-pr;

Dcl-proc main;
  Dcl-pi *n;
  end-pi;

  hello();

  return;

End-proc;